# PANDA'S

Pandas is an open source Library used to work with 2d Dataframes and 2D Array. It provides various structure and operations to do on numerical data with help of Numpy And Pandas Both.
Pandas is fast and it had high perfomance and productivity for users.
It was developed in year 2008 by wes Mckinney.

why we use Pandas?
Fast And Efficient for manupulating and analyzing the data.
Data from diffrent objects can be easily loaded here
Flexible reshaping of datasets.

The Data produced by Pandas are often used as input for Visualization purpose
using multiple another sources and libraries like Matplotlib and SEaborn.
We can do data cleansing,merging and joining of data's through Pandas.

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
#Create a data from list

X=["Unnat","kunal","aman","jay","vishal","dipesh"]
X

['Unnat', 'kunal', 'aman', 'jay', 'vishal', 'dipesh']

In [4]:
Data=pd.DataFrame(X) #Converting list into DAta with Dataframe function
Data
#Column Index starts wih o and even index also start with zero

        0
0   Unnat
1   kunal
2    aman
3     jay
4  vishal
5  dipesh

In [5]:
#creating data from dictionary

In [6]:
dict1={"name":["unnat","rahul","ajay"],
        "Age":[20,21,22],
        "city":["palghar","wada","mumbai"]}

dict1

{'name': ['unnat', 'rahul', 'ajay'],
 'Age': [20, 21, 22],
 'city': ['palghar', 'wada', 'mumbai']}

In [7]:
Student=pd.DataFrame(dict1)
Student

    name  Age     city
0  unnat   20  palghar
1  rahul   21     wada
2   ajay   22   mumbai

In [8]:
#To access a column

Student["name"]

0    unnat
1    rahul
2     ajay
Name: name, dtype: object

In [9]:
#TO Access multiple column

Student[["name","city"]] #When we want to access more than one column we have to write column headers in 2D array

    name     city
0  unnat  palghar
1  rahul     wada
2   ajay   mumbai

In [10]:
#To access details of certain row

Student.iloc[2] #iloc = index location = it is inbuilt function in Pandas

name      ajay
Age         22
city    mumbai
Name: 2, dtype: object

In [11]:
Student.iloc[2,2]

'mumbai'

In [12]:
Student.loc[1,"city"] #Loc stands for location
#in lock function we cant negative indexing we shoul know row index

'wada'

In [13]:
#3rd technique

Student["name"][0] #simple indexing===columnname,row index

'unnat'

In [14]:
Student

    name  Age     city
0  unnat   20  palghar
1  rahul   21     wada
2   ajay   22   mumbai

In [15]:
#TO ACCESS MULTIPLE ROWS AND COLUMNS TOGETHER


Student.iloc[0:2]

    name  Age     city
0  unnat   20  palghar
1  rahul   21     wada

In [16]:
Student.iloc[0::2] #Every alternate rows from start to end

    name  Age     city
0  unnat   20  palghar
2   ajay   22   mumbai

In [17]:
#retrive first 5 rows name and city

Student.iloc[0:2,0::2] #iloc.[row slicing, column slicing]

    name     city
0  unnat  palghar
1  rahul     wada

In [18]:
Student.columns #we use this function to check the column name.

Index(['name', 'Age', 'city'], dtype='object')

In [19]:
Student.info() #To check information about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [20]:
Student.shape #no of rows and columns in your data

(3, 3)

In [21]:
#TO EXTRACT COLUMN NAME WITH INDEX POSITION


for i,c in enumerate(Student.columns):
    print(i,c)

0 name
1 Age
2 city

In [22]:
IPL=pd.read_clipboard() #read_clipboard is a function which read the data which is been copied in clipboard
IPL

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [23]:
IPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       16 non-null     int64
 1   Winner     16 non-null     object
 2   Won By     16 non-null     object
 3   Runner Up  16 non-null     object
 4   Venue      16 non-null     object
dtypes: int64(1), object(4)
memory usage: 768.0+ bytes

In [24]:
IPL.shape

(16, 5)

In [25]:
IPL.columns

Index(['Year', 'Winner', 'Won By', 'Runner Up', 'Venue'], dtype='object')

In [26]:
#top5 rows

IPL.head() #head function gives us first 5 rows

   Year               Winner     Won By              Runner Up      Venue
0  2023  Chennai Super Kings  5 wickets         Gujarat Titans  Ahmedabad
1  2022       Gujarat Titans  7 wickets       Rajasthan Royals  Ahmedabad
2  2021  Chennai Super Kings    27 runs  Kolkata Knight Riders      Dubai
3  2020       Mumbai Indians  5 wickets         Delhi Capitals      Dubai
4  2019       Mumbai Indians      1 run    Chennai Super Kings  Hyderabad

In [27]:
#First 10 rows

IPL.head(10) #insert no. of rows inside the bracket to fetch certain rows

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore

In [28]:
IPL.tail()

,Year,Winner,Won By,Runner Up,Venue
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [29]:
IPL.tail(8)

,Year,Winner,Won By,Runner Up,Venue
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [30]:
IPL

,Year,Winner,Won By,Runner Up,Venue
0,2023,Chennai Super Kings,5 wickets,Gujarat Titans,Ahmedabad
1,2022,Gujarat Titans,7 wickets,Rajasthan Royals,Ahmedabad
2,2021,Chennai Super Kings,27 runs,Kolkata Knight Riders,Dubai
3,2020,Mumbai Indians,5 wickets,Delhi Capitals,Dubai
4,2019,Mumbai Indians,1 run,Chennai Super Kings,Hyderabad
5,2018,Chennai Super Kings,8 wickets,Sunrisers Hyderabad,Mumbai
6,2017,Mumbai Indians,1 run,Rising Pune Supergiants,Hyderabad
7,2016,Sunrisers Hyderabad,8 runs,Royal Challengers Bangalore,Bangalore
8,2015,Mumbai Indians,41 runs,Chennai Super Kings,Kolkata
9,2014,Kolkata Knight Riders,3 wickets,Kings XI Punjab,Bangalore
10,2013,Mumbai Indians,23 runs,Chennai Super Kings,Kolkata
11,2012,Kolkata Knight Riders,5 wickets,Chennai Super Kings,Chennai
12,2011,Chennai Super Kings,58 runs,Royal Challengers Bangalore,Chennai
13,2010,Chennai Super Kings,22 runs,Mumbai Indians,Mumbai
14,2009,Deccan Chargers,6 runs,Royal Challengers Bangalore,Johannesburg
15,2008,Rajasthan Royals,3 wickets,Chennai Super Kings,Mumbai

In [31]:
#To fetch only winner column data

IPL['Winner']

0       Chennai Super Kings
1            Gujarat Titans
2       Chennai Super Kings
3            Mumbai Indians
4            Mumbai Indians
5       Chennai Super Kings
6            Mumbai Indians
7       Sunrisers Hyderabad
8            Mumbai Indians
9     Kolkata Knight Riders
10           Mumbai Indians
11    Kolkata Knight Riders
12      Chennai Super Kings
13      Chennai Super Kings
14          Deccan Chargers
15         Rajasthan Royals
Name: Winner, dtype: object

In [32]:
#to fetch winner,won by, venue

IPL[["Winner","Won By","Venue"]]

                   Winner     Won By         Venue
0     Chennai Super Kings  5 wickets     Ahmedabad
1          Gujarat Titans  7 wickets     Ahmedabad
2     Chennai Super Kings    27 runs         Dubai
3          Mumbai Indians  5 wickets         Dubai
4          Mumbai Indians      1 run     Hyderabad
5     Chennai Super Kings  8 wickets        Mumbai
6          Mumbai Indians      1 run     Hyderabad
7     Sunrisers Hyderabad     8 runs     Bangalore
8          Mumbai Indians    41 runs       Kolkata
9   Kolkata Knight Riders  3 wickets     Bangalore
10         Mumbai Indians    23 runs       Kolkata
11  Kolkata Knight Riders  5 wickets       Chennai
12    Chennai Super Kings    58 runs       Chennai
13    Chennai Super Kings    22 runs        Mumbai
14        Deccan Chargers     6 runs  Johannesburg
15       Rajasthan Royals  3 wickets        Mumbai

In [33]:
#TO CHECK UNIQUE DATA OF PARTICULAR COLUMN

IPL["Winner"].unique()

array(['Chennai Super Kings', 'Gujarat Titans', 'Mumbai Indians',
       'Sunrisers Hyderabad', 'Kolkata Knight Riders', 'Deccan Chargers',
       'Rajasthan Royals'], dtype=object)

In [34]:
#TO check unique of all columns

for i in IPL:
    print(i,":" , IPL[i].unique())
    print("_____________________________________________________________________________________")

Year : [2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010
 2009 2008]
_____________________________________________________________________________________
Winner : ['Chennai Super Kings' 'Gujarat Titans' 'Mumbai Indians'
 'Sunrisers Hyderabad' 'Kolkata Knight Riders' 'Deccan Chargers'
 'Rajasthan Royals']
_____________________________________________________________________________________
Won By : ['5 wickets' '7 wickets' '27 runs' '1 run' '8 wickets' '8 runs' '41 runs'
 '3 wickets' '23 runs' '58 runs' '22 runs' '6 runs']
_____________________________________________________________________________________
Runner Up : ['Gujarat Titans' 'Rajasthan Royals' 'Kolkata Knight Riders'
 'Delhi Capitals' 'Chennai Super Kings' 'Sunrisers Hyderabad'
 'Rising Pune Supergiants' 'Royal Challengers Bangalore' 'Kings XI Punjab'
 'Mumbai Indians']
_____________________________________________________________________________________
Venue : ['Ahmedabad' 'Dubai' 'Hyderabad' 'Mumbai' 'Bangalore' 'Kolkata' 'Chennai'
 'Johannesburg']
_____________________________________________________________________________________

In [35]:
#FILTERING TH DATA

#condition to chek where it is true and where it is false
IPL["Winner"]=="Mumbai Indians"

0     False
1     False
2     False
3      True
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12    False
13    False
14    False
15    False
Name: Winner, dtype: bool

In [36]:
IPL[IPL["Winner"]=="Mumbai Indians"]  #It is called condition filtering
#Dataframe[Dataframe[column name]== condition]

#this sintax works as a conditional filtering of data

    Year          Winner     Won By                Runner Up      Venue
3   2020  Mumbai Indians  5 wickets           Delhi Capitals      Dubai
4   2019  Mumbai Indians      1 run      Chennai Super Kings  Hyderabad
6   2017  Mumbai Indians      1 run  Rising Pune Supergiants  Hyderabad
8   2015  Mumbai Indians    41 runs      Chennai Super Kings    Kolkata
10  2013  Mumbai Indians    23 runs      Chennai Super Kings    Kolkata

In [37]:
MI=IPL[IPL["Winner"]=="Mumbai Indians"]  #using variable we can store our data
MI

    Year          Winner     Won By                Runner Up      Venue
3   2020  Mumbai Indians  5 wickets           Delhi Capitals      Dubai
4   2019  Mumbai Indians      1 run      Chennai Super Kings  Hyderabad
6   2017  Mumbai Indians      1 run  Rising Pune Supergiants  Hyderabad
8   2015  Mumbai Indians    41 runs      Chennai Super Kings    Kolkata
10  2013  Mumbai Indians    23 runs      Chennai Super Kings    Kolkata